[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [NonProd - 244172364962 / Turbonomic-EC2 ](https://app.env0.com/p/7320dd7a-4822-426c-84b5-62ddd8be0799/environments/78a77c76-cab0-44ad-bd0d-60792ad423e0):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:


  # module.acme-ec2.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
!       ami                                  = "ami-0cd202468248306f2" -> "ami-0bf3fc7dfe888c036" # forces replacement
!       arn                                  = "arn:aws:ec2:us-west-2:244172364962:instance/i-0d412a3c54efede3a" -> (known after apply)
!       associate_public_ip_address          = false -> true # forces replacement
!       availability_zone                    = "us-west-2b" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
!       id                                   = "i-0d412a3c54efede3a" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
!       instance_state                       = "stopped" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
+       key_name                             = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       primary_network_interface_id         = "eni-03b85aa0308d2c2d0" -> (known after apply)
!       private_dns                          = "ip-10-0-3-232.us-west-2.compute.internal" -> (known after apply)
!       private_ip                           = "10.0.3.232" -> (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
!       tags                                 = {
!           "Demo"                = "Dec 17" -> "April 1"
            "ENV0_URL"            = "https://app.env0.com/p/7320dd7a-4822-426c-84b5-62ddd8be0799/environments/78a77c76-cab0-44ad-bd0d-60792ad423e0"
            "Name"                = "turbonomic-ec2"
            "Owner"               = "acme demo org"
            "Terraform"           = "true"
            "Test"                = "new tag"
            "env0_environment_id" = "78a77c76-cab0-44ad-bd0d-60792ad423e0"
            "env0_project_id"     = "7320dd7a-4822-426c-84b5-62ddd8be0799"
        }
!       tags_all                             = {
!           "Demo"                = "Dec 17" -> "April 1"
            # (7 unchanged elements hidden)
        }
!       vpc_security_group_ids               = [
-           "sg-08fdaac30443c7649",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

-       enclave_options {
-           enabled = false -> null
        }

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           device_name           = "/dev/sda1" -> null
-           encrypted             = false -> null
-           iops                  = 3000 -> null
-           tags                  = {} -> null
-           throughput            = 125 -> null
-           volume_id             = "vol-0b861faeaa0e7edcb" -> null
-           volume_size           = 8 -> null
-           volume_type           = "gp3" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   instances  = [
-       "i-0d412a3c54efede3a",
+       (known after apply),
    ]
!   private_ip = [
-       "10.0.3.232",
+       (known after apply),
    ]
!   public_ip  = [
-       "35.90.131.209",
+       (known after apply),
    ]
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "password" but a value
│ was found in file "env0.auto.tfvars.json". If you meant to use this value,
│ add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "db_username" but a value
│ was found in file "env0.auto.tfvars.json". If you meant to use this value,
│ add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```
</details>


```
Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  +$0.16 ($56 → $56)
Percent: 0%
```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: env0/acme-demo/.env0workdir/env0_tf_plan.json

! module.acme-ec2.aws_instance.this[0]
  +$0.16 ($56 → $56)

!     root_block_device
    
!         Storage (general purpose SSD, gp3 → gp2)
          +$0.16 ($0.64 → $0.80)

Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  +$0.16 ($56 → $56)
Percent: 0%

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

1 cloud resource was detected:
∙ 1 was estimated

Infracost estimate: Monthly estimate increased by $0.16 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                    ┃ Baseline cost ┃ Usage cost* ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ env0/acme-demo/.env0workdir/env0_tf_plan.json      ┃        +$0.16 ┃           - ┃  +$0.16 (0%) ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/7320dd7a-4822-426c-84b5-62ddd8be0799/environments/78a77c76-cab0-44ad-bd0d-60792ad423e0/deployments/a72e540a-98b4-4e51-a808-50c9b4279a31)
